
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеДанных");
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокПоставщиков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	ОбновитьСписокПоставщиков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервере
Процедура ОбновитьСписокПоставщиков()
	Перем МассивПоставщиков;
	Перем ВыборкаДетальныеЗаписи;
	Перем Запрос;
	Перем РезультатЗапроса;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоставщикиОказываемыеУслуги.Ссылка
		|ИЗ
		|	Справочник.Поставщики.ОказываемыеУслуги КАК ПоставщикиОказываемыеУслуги
		|ГДЕ
		|	ПоставщикиОказываемыеУслуги.Услуга = &Услуга";
	
	Запрос.УстановитьПараметр("Услуга", Объект.Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивПоставщиков = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПоставщиков.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Элементы.Поставщик.РежимВыбораИзСписка = Истина;
	Элементы.Поставщик.СписокВыбора.Очистить();
	Элементы.Поставщик.СписокВыбора.ЗагрузитьЗначения(МассивПоставщиков);
КонецПроцедуры

#КонецОбласти
