

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

//@skip-check data-exchange-load
Процедура ПриЗаписи(Отказ)
	Узел = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(Узел.Владелец) Тогда
		Узел.Владелец = Ссылка;
		Узел.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
