#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр РеестрУслугПоПоставщикам
	Движения.РеестрУслугПоПоставщикам.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныПоставщиков из ЦеныПоставщиков Цикл
		Движение = Движения.РеестрУслугПоПоставщикам.Добавить();
		Движение.Период = ТекСтрокаЦеныПоставщиков.НачалоДействия;
		Движение.Услуга = Услуга;
		Движение.Поставщик = ТекСтрокаЦеныПоставщиков.Поставщик;
		Движение.ВидЦены = ТекСтрокаЦеныПоставщиков.ВидЦены;
		Движение.ЕдиницаИзмерения = ТекСтрокаЦеныПоставщиков.ЕдиницаИзмерения;
		Движение.Количество = ТекСтрокаЦеныПоставщиков.Количество;
		Движение.Цена = ТекСтрокаЦеныПоставщиков.Цена;
		Движение.ОкончаниеДействия = ТекСтрокаЦеныПоставщиков.ОкончаниеДействия;
	КонецЦикла;

КонецПроцедуры

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
