

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок //<ИмяТаблицыФормы>

// Код процедур и функций
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда Возврат; КонецЕсли;
	СтандартнаяОбработка = Ложь;
	Количество = КоличествоЗадействованныхРесурсов(ВыбраннаяСтрока);
	стПараметры = Новый Структура("Ключ", ВыбраннаяСтрока);
	Если Количество = 1 Тогда
		ОткрытьФорму("Документ.Расчет.Форма.ФормаВводИстории", стПараметры);
	Иначе
		ОткрытьФорму("Документ.Расчет.Форма.ФормаДокумента", стПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция КоличествоЗадействованныхРесурсов(ВыбраннаяСтрока)
	Количество = 0;
	НаборУслуг = Неопределено;
	Для Каждого Строка Из ВыбраннаяСтрока.Расчеты Цикл
		Если НаборУслуг <> Строка.НаборУслуг Тогда
			Количество = Количество + 1;
			НаборУслуг = Строка.НаборУслуг;
		КонецЕсли;
	КонецЦикла;
	Возврат Количество;
КонецФункции
#КонецОбласти
