
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	Если ОбменМобильноеПриложение.ВыполнитьОбменДанными(ТекстОшибки, Неопределено) Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.Расчет"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Абоненты"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Адреса"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.НаборыУслуг"));
		ПоказатьОповещениеПользователя("Синхронизация данных завершена.");
		Оповестить("ОбновлениеДанных");
	Иначе
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;        
	
КонецПроцедуры
#КонецОбласти
