#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр РасчетыЗаУслуги
	Движения.РасчетыЗаУслуги.Записывать = Истина;
	ВидРасчета = Перечисления.ВидыЦены.Фактическая;
	Для Каждого Строка Из Отметки Цикл
		Расход = Строка.ТекущиеПоказания - Строка.ПредыдущиеПоказания; 
		ДельтаБаланса = -1 * Расход * РасчетыВызовСервера.ТарифДляНабораУслуг(НаборУслуг, ВидРасчета, Дата);
		РасчетыВызовСервера.ДобавитьДвижениеРасчетов(Движения, Строка.ВремяОтметки, НаборУслуг, ВидРасчета, Расход, ДельтаБаланса);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
