

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы()
#Если МобильноеПриложениеКлиент Тогда
	ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ОбработкаЛокальныхУведомлений");
#КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаЛокальныхУведомлений(Уведомление, Локальное, Показано) Экспорт
	СсылкаОтметок = СериализаторXDTO.XMLЗначение(Тип("ДокументСсылка.ОтметкиСчетчика"), Уведомление.Данные);
	Если Локальное Тогда
		ОткрытьФорму("Документ.ОтметкиСчетчика.Форма.ФормаДокумента", Новый Структура("Ключ", СсылкаОтметок));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область Инициализация

#КонецОбласти
