
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Код процедур и функций

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если Не ЗначениеЗаполнено(Константы.АдресЦентральнойБазы.Получить()) Тогда
		Константы.АдресЦентральнойБазы.Установить("http://192.168.8.8/radio");
	КонецЕсли;
	Узел = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Если ЗначениеЗаполнено(Узел.Владелец) Тогда
		Владелец = Узел.Владелец.ПолучитьОбъект();
		Если Узел.Код <> Владелец.Код Тогда
			Владелец.Код = Узел.Код;
			Владелец.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
