

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Декорация1.Картинка = БиблиотекаКартинок[Объект.ИмяКартинки];
	Если ЗначениеЗаполнено(Объект.ИмяКартинки) Тогда
		Элементы.ИмяКартинки.Видимость = Ложь;
	КонецЕсли; 
	Фото = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Фото");
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ТекущийОбъект.ИмяКартинки <> СокрЛП(Объект.ИмяКартинки) Тогда
		ТекущийОбъект.ИмяКартинки = СокрЛП(Объект.ИмяКартинки);
		ТекущийОбъект.Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЭтоАдресВременногоХранилища(Фото) Тогда
		ТекущийОбъект.Фото = Новый ХранилищеЗначения(БиблиотекаКартинок[Объект.ИмяКартинки]);
	КонецЕсли;
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Фото = ПоместитьВоВременноеХранилище(БиблиотекаКартинок[Объект.ИмяКартинки]);
КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
