

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Декорация1.Картинка = БиблиотекаКартинок[Объект.ИмяКартинки];
	Если ЗначениеЗаполнено(Объект.ИмяКартинки) Тогда
		Элементы.ИмяКартинки.Видимость = Ложь;
	КонецЕсли; 
	Фото = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Фото");
КонецПроцедуры

&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗагрузитьФото();
КонецПроцедуры 

&НаКлиенте
Асинх Процедура ЗагрузитьФото()
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,,, Новый УникальныйИдентификатор);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Фото = Результат.Адрес;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЭтоАдресВременногоХранилища(Фото) Тогда
		ТекущийОбъект.Фото = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	КонецЕсли;
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
