#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущиеПоказания = 0;
	Если Параметры.Свойство("ТекущиеПоказания", ТекущиеПоказания) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
			"ВремяОтметки,ПредыдущиеПоказания,ТекущиеПоказания,СтрогийРежимОтметок,НомерСтроки");
	Иначе
		Отказ = Истина;
	КонецЕсли;
	спРазряды.Добавить(ТекущиеПоказания * 10 % 10);
	СтрокаРазряд = Формат(Окр(ТекущиеПоказания, 0), "ЧЦ=6; ЧГ=; ЧВН=;ЧН=0000000");
	Индекс = 6;
	Пока Индекс > 0 Цикл
		спРазряды.Добавить(Число(Сред(СтрокаРазряд, Индекс, 1)));
		Индекс = Индекс - 1;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	ОповеститьОВыборе(Новый Структура("ТекущиеПоказания,НомерСтроки", ТекущиеПоказания, НомерСтроки));
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд1(Команда)
	ИзменитьРазряд(1);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд2(Команда)
	ИзменитьРазряд(2);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд3(Команда)
	ИзменитьРазряд(3);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд4(Команда)
	ИзменитьРазряд(4);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд5(Команда)
	ИзменитьРазряд(5);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазряд6(Команда)
	ИзменитьРазряд(6);
КонецПроцедуры

&НаКлиенте
Процедура ПрираститьРазрядД(Команда)
	ИзменитьРазряд(0);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд1(Команда)
	ИзменитьРазряд(1, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд2(Команда)
	ИзменитьРазряд(2, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд3(Команда)
	ИзменитьРазряд(3, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд4(Команда)
	ИзменитьРазряд(4, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд5(Команда)
	ИзменитьРазряд(5, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазряд6(Команда)
	ИзменитьРазряд(6, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьРазрядД(Команда)
	ИзменитьРазряд(0, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ИзменитьРазряд(НомерРазряда, Прирост = Истина)
	Если НомерРазряда = 7 Тогда Возврат Ложь; КонецЕсли;
	Если Прирост Тогда
		Изменение = 1;
	Иначе
		Изменение = -1;
	КонецЕсли;
	фПограничный = (спРазряды[НомерРазряда].Значение = 9 И Прирост) ИЛИ (спРазряды[НомерРазряда].Значение = 0 И Не Прирост);
	Если фПограничный Тогда
		Если ИзменитьРазряд(НомерРазряда + 1, Прирост) Тогда
			спРазряды[НомерРазряда].Значение = ?(Прирост, 0, 9);
		Иначе 
			Возврат Ложь;
		КонецЕсли;
	Иначе
		спРазряды[НомерРазряда].Значение = спРазряды[НомерРазряда].Значение + Изменение;
	КонецЕсли;
	показания = спРазряды[0].Значение / 10;
	Для Индекс = 1 По спРазряды.Количество() - 1 Цикл
		показания = показания + pow(10, Индекс - 1) * спРазряды[Индекс].Значение;
	КонецЦикла;
	ТекущиеПоказания = показания;
	Расход = ТекущиеПоказания - ПредыдущиеПоказания;
	Возврат Истина;
КонецФункции
#КонецОбласти