
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(НаборКонстант.ВремяВечернихУведомлений) Тогда
		НаборКонстант.ВремяВечернихУведомлений = Дата(1, 1, 1, 23, 0, 0);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НаборКонстант.ВремяУтреннихУведомлений) Тогда
		НаборКонстант.ВремяУтреннихУведомлений = Дата(1, 1, 1, 7, 0, 0);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
