#Если Сервер Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СформироватьПодсказкиПоАдресам(ТекстЗапроса) Экспорт

	СоединениеСРесурсом = Новый HTTPСоединение("https://suggestions.dadata.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;

	ЗапросКРесурсу = Новый HTTPЗапрос("/suggestions/api/4_1/rs/suggest/address", Заголовки);
	ЗапросКРесурсу.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗапросКРесурсу.Заголовки.Вставить("Accept", "application/json");
	ЗапросКРесурсу.Заголовки.Вставить("Authorization", "Token 0e533949abc3edbda7afaeba7b9d9295b3b9c207");
	ТелоЗапроса = "query=" + ТекстЗапроса;
	ЗапросКРесурсу.УстановитьТелоИзСтроки(ТелоЗапроса);

	ОтветРесурса = СоединениеСРесурсом.ОтправитьДляОбработки(ЗапросКРесурсу);

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветРесурса.ПолучитьТелоКакСтроку());

	Попытка
		ОтветОбъект = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Сообщить("Ошибка при выставлении счёта");
	КонецПопытки;

	РезультатЗапроса = Новый Массив;
	Если ОтветОбъект.Свойство("suggestions", РезультатЗапроса) Тогда
		Если РезультатЗапроса = "fail" Тогда
			Сообщить(ОтветОбъект.msg);
		КонецЕсли;
	КонецЕсли;

	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли