
#Область ПрограммныйИнтерфейс
Функция СформироватьПодсказкиПоАдресам(ТекстЗапроса) Экспорт

	СоединениеСРесурсом = Новый HTTPСоединение("suggestions.dadata.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;

	ЗапросКРесурсу = Новый HTTPЗапрос("/suggestions/api/4_1/rs/suggest/address", Заголовки);
	ЗапросКРесурсу.Заголовки.Вставить("Content-Type", "application/json");
	ЗапросКРесурсу.Заголовки.Вставить("Accept", "application/json");
	ЗапросКРесурсу.Заголовки.Вставить("Authorization", "Token 0e533949abc3edbda7afaeba7b9d9295b3b9c207");
	ЗаписьСообщения = Новый ЗаписьJSON();
	ЗаписьСообщения.УстановитьСтроку();
	ЗаписьСообщения.ЗаписатьНачалоОбъекта();
	ЗаписьСообщения.ЗаписатьИмяСвойства("query");
	ЗаписьСообщения.ЗаписатьЗначение(ТекстЗапроса);
	ЗаписьСообщения.ЗаписатьКонецОбъекта();
	ТелоЗапроса = ЗаписьСообщения.Закрыть();
	ЗапросКРесурсу.УстановитьТелоИзСтроки(ТелоЗапроса, "utf-8");

	ОтветРесурса = СоединениеСРесурсом.ОтправитьДляОбработки(ЗапросКРесурсу);

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветРесурса.ПолучитьТелоКакСтроку());

	Попытка
		ОтветОбъект = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Сообщить("Ошибка при выставлении счёта");
	КонецПопытки;

	ПринятыеДанные = Новый Массив;
	РезультатЗапроса = Новый Массив;
	Если ОтветОбъект.Свойство("suggestions", ПринятыеДанные) Тогда
		Для Каждого Элемент Из ПринятыеДанные Цикл
			стРезультат = Новый Структура("Наименование,ПочтовыйИндекс,Регион,Район,НаселенныйПункт,Улица,
			|	Дом,Квартира,КЛАДР_ИД");
			стРезультат.Наименование = Элемент.value;
			стРезультат.ПочтовыйИндекс = Элемент.data.postal_code;
			стРезультат.Регион = Элемент.data.region;
			стРезультат.Район = Элемент.data.area;
			стРезультат.НаселенныйПункт = Элемент.data.city;
			стРезультат.Улица = Элемент.data.street;
			стРезультат.Дом = Элемент.data.house;
			стРезультат.Литера = Элемент.data.block;
			стРезультат.Квартира = Элемент.data.room;
			РезультатЗапроса.Добавить(стРезультат);
		КонецЦикла;		
	КонецЕсли;

	Возврат РезультатЗапроса;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
