#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций
// Процедура отправляет идентификатор источнику push-уведомлений
//
// Параметры:
//  ИдентификаторПодписчикаУведомлений - Строка - новый идентификатор
//  ТекстОшибки - Строка - параметр для возврата информации об ошибках
//
Процедура ПередатьИдентификаторПодписчикаУведомлений(ИдентификаторПодписчикаУведомлений, ТекстОшибки) Экспорт
	
	СтарыйИдентификатор = Константы.ИдентификаторПодписчикаУведомлений.Получить().Получить();
	
	Если СтарыйИдентификатор <> ИдентификаторПодписчикаУведомлений Тогда
	    Прокси = ОбменМобильноеПриложение.ПолучитьПрокси(ТекстОшибки);
	    Если Прокси = Неопределено Тогда
	        ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		Узел = ПланыОбмена.Мобильные.ЭтотУзел();
		Сериализатор = Новый СериализаторXDTO(Прокси.ФабрикаXDTO);
    	ИдентификаторXDTO = Сериализатор.ЗаписатьXDTO(ИдентификаторПодписчикаУведомлений);
		//@skip-check reading-attribute-from-database
		Прокси.НовыйИдентификаторПодписчикаУведомлений(Узел.Код, ИдентификаторXDTO);
		
		Константы.ИдентификаторПодписчикаУведомлений.Установить(Новый ХранилищеЗначения(ИдентификаторПодписчикаУведомлений));
	КонецЕсли;
    
КонецПроцедуры

#КонецОбласти