#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Узел = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Если ЗначениеЗаполнено(Узел.Владелец) Тогда
		Абонент = Узел.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеДанных");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Абонент) Тогда
		Узел = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
		Если Абонент <> Узел.Владелец Тогда
			Узел.Владелец = Абонент;
			Узел.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Если Записать() Тогда
		ТекстОшибки = "";
		Если ОбменМобильноеПриложение.ЗарегистрироватьКаналСвязи(ТекстОшибки, Абонент) Тогда
				ПоказатьПредупреждение( , "Синхронизация данных завершена.", 5);
				ОповеститьОбИзменении(Тип("СправочникСсылка.Абоненты"));
				ОповеститьОбИзменении(Тип("СправочникСсылка.Адреса"));
				ОповеститьОбИзменении(Тип("СправочникСсылка.НаборыУслуг"));
				ОповеститьОбИзменении(Тип("ДокументСсылка.Расчет"));
				Оповестить("ОбновлениеДанных");
				ОбновитьАбонента();
			Иначе
				ПоказатьПредупреждение( , ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьАбонента()
	Перем Узел;
	Узел = ПланыОбмена.Мобильные.ЭтотУзел().ПолучитьОбъект();
	Абонент = Узел.Владелец;
КонецПроцедуры
#КонецОбласти
